Use titanic dataset. Use the attributes: Class of the room, Sex, Age, number of siblings/spouses, number of parents/children, passenger fare and port of embarkation information. Compare the result of Na√Øve bayes Classifier with the Decision tree classifier and Logistic Regessor implemented in Lab Session 4.

In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [2]:
#importing the titanic dataset
titanic_df=pd.read_csv('https://raw.githubusercontent.com/kajalpanda1/DatasetRepository/master/Titanic.csv')

In [3]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [5]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
titanic_df=titanic_df.drop(columns=['PassengerId','Name','Ticket','Cabin'])

In [7]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [9]:
#filling null values for Age and Embarked feature column
titanic_df['Age']=titanic_df['Age'].fillna(titanic_df['Age'].median())
titanic_df['Embarked']=titanic_df['Embarked'].fillna('ffill')

In [10]:
#converting categorical values into numerical values
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
titanic_df['Embarked']=le.fit_transform(titanic_df['Embarked'])
titanic_df['Sex']=le.fit_transform(titanic_df['Sex'])

In [11]:
#extracting feature and target set from the dataset
features_df=titanic_df.iloc[:,1:].values
target_df=titanic_df.iloc[:,0].values

In [12]:
#standardizing features dataframe 
from sklearn.preprocessing import StandardScaler
norm=StandardScaler()
features_df=norm.fit_transform(features_df)

In [13]:
#splitting dataset into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(features_df,target_df,test_size=0.25,random_state=10)

In [14]:
#using training set to create a naive bayes classifier model
gnb=GaussianNB()
titanic_nb=gnb.fit(X_train,y_train)

In [34]:
#using training set to create a decision tree model
titanic_tree=DecisionTreeClassifier(criterion="gini",max_depth=4,random_state=10)
titanic_tree.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=4, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=10, splitter='best')

In [16]:
#using training set to create a logistic regression model
titanic_logr=LogisticRegression(solver='liblinear',C=0.001,random_state=10)
titanic_logr.fit(X_train, y_train)

LogisticRegression(C=0.001, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=10, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [35]:
y_pred_nb=titanic_nb.predict(X_test)
y_pred_dt=titanic_tree.predict(X_test)
y_pred_lgr=titanic_logr.predict(X_test)

In [28]:
print("Accuracy for Naive Bayes Classifier:",accuracy_score(y_test,y_pred_nb)*100)

Accuracy for Naive Bayes Classifier: 84.61538461538461

In [36]:
print("Accuracy for Decision Tree Classifier:",accuracy_score(y_test,y_pred_dt)*100)

Accuracy for Decision Tree Classifier: 76.92307692307693

In [30]:
print("Accuracy for Logistic Regressor:",accuracy_score(y_test,y_pred_lgr)*100)

Accuracy for Logistic Regressor: 82.05128205128204